wayne-love/sn_esp32/src/main.cpp
#include <Arduino.h>

#if defined(ESP8266)
  #include <ESP8266WiFi.h>
  #include <ESP8266WebServer.h>

#elif defined(ESP32)
  #include <WiFi.h>
  #include <WebServer.h>

#endif

#include <WiFiClient.h>
#include <WiFiManager.h>
#include <RemoteDebug.h>
#include <PubSubClient.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <vector>
#include <Time.h>
#include <TimeLib.h>
#if defined(LED_PIN)
#include "Blinker.h"
#endif
#include "WebUI.h"

#include "SpaInterface.h"

#if defined(ESP32)
#include <Preferences.h>
#endif

#ifndef DEBUG_ENABLED
    #define DEBUG_ENABLED
    RemoteDebug Debug;
#endif

// Define the threshold for detecting a fast reboot (within 20 seconds)
#define REBOOT_THRESHOLD 20

#if defined(ESP8266)
struct RTCData {
  int16_t magicNumber;  // Use a unique number to identify valid data
  int16_t rebootFlag;   // -1 failed to load, 0 flag cleared = don't start wifi manager, 1 start wifi manager on next boot, 2 start wifi manager now.
};
RTCData rtcData;
const int16_t MAGIC_NUMBER = 0xAAAA;
#endif

#if defined(ESP32)
Preferences preferences;  // For ESP32 reboot storage
#endif

unsigned long bootStartMillis;  // To track when the device started
bool rebootFlag = false;

SpaInterface si;

#if defined(LED_PIN)
Blinker led(LED_PIN);
#endif
WiFiClient wifi;
PubSubClient mqttClient(wifi);

WebUI ui(&si);



bool saveConfig = false;
ulong mqttLastConnect = 0;
ulong wifiLastConnect = millis();
ulong bootTime = millis();
ulong statusLastPublish = millis();
bool autoDiscoveryPublished = false;

String mqttServer = "";
String mqttPort = "";
String mqttUserName = "";
String mqttPassword = "";

String mqttBase = "";
String mqttStatusTopic = "";
String mqttSet = "";
String mqttAvailability = "";

String spaSerialNumber = "";

// Function to convert integer to time in HH:mm format
String convertToTime(int data) {
  // Extract hours and minutes from data
  int hours = (data >> 8) & 0xFF; // High byte for hours
  int minutes = data & 0xFF;      // Low byte for minutes

  // If minutes are greater than or equal to 100, adjust hours and minutes
  if (minutes >= 100) {
    int extraHours = minutes / 100;
    minutes = minutes % 100;
    hours += extraHours;
  }

  String timeStr = String(hours / 10) + String(hours % 10) + ":" +
                   String(minutes / 10) + String(minutes % 10);

  // Print debug information
  debugV("data: %i, timeStr: %s", data, timeStr.c_str());

  return timeStr;
}

int convertToInteger(const String& timeStr) {
  int data = -1;

  // Check for an empty string
  if (timeStr.length() == 0) {
    return data;
  }

  // Find the position of the colon
  int colonIndex = timeStr.indexOf(':');
  if (colonIndex == -1) {
    return data; // Invalid format
  }

  // Extract hours and minutes as substrings
  int hours = timeStr.substring(0, colonIndex).toInt();
  int minutes = timeStr.substring(colonIndex + 1).toInt();

  // Validate hours and minutes ranges
  if (hours >= 0 && hours < 24 && minutes >= 0 && minutes < 60) {
    data = (hours * 256) + minutes;
  }

  // Print debug information
  debugV("data: %i, timeStr: %s", data, timeStr.c_str());

  return data;
}

void saveConfigCallback(){
  saveConfig = true;
}

bool readRebootFlag() {
  bool retVal = false;

  #if defined(ESP8266)
    ESP.rtcUserMemoryRead(0, (uint32_t*)&rtcData, sizeof(rtcData));
    // Check if the magic number matches
    if (rtcData.magicNumber != MAGIC_NUMBER) {
      debugD("Invalid or uninitialized RTC memory.");
    } else {
      retVal = (rtcData.rebootFlag  == 1);
    }
  #elif defined(ESP32)
    preferences.begin("reboot_data", false);
    retVal = preferences.getBool("rebootFlag", false);
    preferences.end();
  #endif
  rebootFlag = retVal;
  return retVal;
}

void writeRebootFlag(bool flagValue) {
  rebootFlag = flagValue;
  #if defined(ESP8266)
    // Write MAGIC_NUMBER so we can validate the data when we read it later
    rtcData.magicNumber = MAGIC_NUMBER;
    rtcData.rebootFlag = flagValue?1:0;
    ESP.rtcUserMemoryWrite(0, (uint32_t*)&rtcData, sizeof(rtcData));
  #elif defined(ESP32)
    preferences.begin("reboot_data", false);
    preferences.putBool("rebootFlag", flagValue);
    preferences.end();
  #endif
}

void startWiFiManager(){
  writeRebootFlag(false);
  if (ui.initialised) {
    ui.server->stop();
  }

  WiFiManager wm;
  WiFiManagerParameter custom_mqtt_server("server", "MQTT server", mqttServer.c_str(), 40);
  WiFiManagerParameter custom_mqtt_port("port", "MQTT port", mqttPort.c_str(), 6);
  WiFiManagerParameter custom_mqtt_username("username", "MQTT Username", mqttUserName.c_str(), 20 );
  WiFiManagerParameter custom_mqtt_password("password", "MQTT Password", mqttPassword.c_str(), 40 );
  wm.addParameter(&custom_mqtt_server);
  wm.addParameter(&custom_mqtt_port);
  wm.addParameter(&custom_mqtt_username);
  wm.addParameter(&custom_mqtt_password);
  wm.setBreakAfterConfig(true);
  wm.setSaveConfigCallback(saveConfigCallback);


  wm.startConfigPortal();
  debugI("Exiting Portal");

  if (saveConfig) {
    mqttServer = String(custom_mqtt_server.getValue());
    mqttPort = String(custom_mqtt_port.getValue());
    mqttUserName = String(custom_mqtt_username.getValue());
    mqttPassword = String(custom_mqtt_password.getValue());

    debugI("Updating config file");
    JsonDocument json;
    json["mqtt_server"] = mqttServer;
    json["mqtt_port"] = mqttPort;
    json["mqtt_password"] = mqttPassword;
    json["mqtt_username"] = mqttUserName;

    File configFile = LittleFS.open("/config.json","w");
    if (!configFile) {
      debugE("Failed to open config file for writing");
    } else {
      serializeJson(json, configFile);
      configFile.close();
      debugI("Config file updated");
    }
  }
}

// We check the EN_PIN every loop, to allow people to configure the system
void checkButton(){
#if defined(EN_PIN)
  if(digitalRead(EN_PIN) == LOW) {
    debugI("Initial buttong press detected");
    delay(100); // wait and then test again to ensure that it is a held button not a press
    if(digitalRead(EN_PIN) == LOW) {
      debugI("Button press detected. Starting Portal");
      startWiFiManager();

