wayne-love/sn_esp32/src/main.cpp
      ESP.restart();  // restart, dirty but easier than trying to restart services one by one
    }
  }
#endif
}

void checkRebootThreshold(){
  // Check if REBOOT_THRESHOLD seconds have passed since the boot time, then clear the reboot flag
  if (rebootFlag && millis() - bootStartMillis > (REBOOT_THRESHOLD * 1000)) {
    debugI("Clear reboot flag after %i seconds.", REBOOT_THRESHOLD);
    writeRebootFlag(false);
  }
}

bool shouldStartWiFiManager() {
  bool isSelectedRebootReason = false;

  #if defined(ESP8266)
    uint32_t resetReason = ESP.getResetInfoPtr()->reason;
    debugI("ESP8266 Reset Reason: %d", resetReason);

    // Check selected reset reasons for ESP8266
    if (resetReason == REASON_SOFT_RESTART || resetReason == REASON_EXT_SYS_RST) {
      isSelectedRebootReason = true;
    }

  #elif defined(ESP32)
    esp_reset_reason_t resetReason = esp_reset_reason();
    debugI("ESP32 Reset Reason: %d", resetReason);

    // Check selected reset reasons for ESP32
    if (resetReason == ESP_RST_POWERON || resetReason == ESP_RST_EXT || resetReason == ESP_RST_SW) {
      isSelectedRebootReason = true;
    }
  #endif

  return (isSelectedRebootReason && rebootFlag);
}

#pragma region Auto Discovery

/// @brief Publish a Sensor via MQTT auto discovery
/// @param name Sensor name
/// @param entityCategory https://developers.home-assistant.io/blog/2021/10/26/config-entity?_highlight=diagnostic#entity-categories (empty string accepted)
/// @param deviceClass Sensor, etc (empty string accepted)
/// @param stateTopic Mqtt topic to read state information from.
/// @param unitOfMeasurement V, W, A, mV, etc (empty string accepted)
/// @param valueTemplate HA value template to parse topic payload to derive value
/// @param stateClass https://developers.home-assistant.io/docs/core/entity/sensor/#long-term-statistics (empty string accepted)
/// @param propertId Unique ID of the property
/// @param deviceName Spa name eg MySpa
/// @param deviceIdentifier Spa serial number eg 123456-789012
void sensorADPublish(String name, String entityCategory, String deviceClass, String stateTopic, String unitOfMeasurement, String valueTemplate, String stateClass, String propertyId, String deviceName, String deviceIdentifier ) {

/*
{ 
   "device_class":"temperature",
   "state_topic":"homeassistant/sensor/sensorBedroom/state",
   "unit_of_measurement":"°C",
   "value_template":"{{ value_json.temperature}}",
   "unique_id":"temp01ae",
   "device":{
      "identifiers":[
         "bedroom01ae"
      ],
      "name":"Bedroom"
   }
}"
*/

  JsonDocument json;
  String uniqueID = spaSerialNumber + "-" + propertyId;

  json["name"]=name;
  if (entityCategory != "") {json["entity_category"] = entityCategory; }
  if (deviceClass != "") { json["device_class"] = deviceClass; }
  json["state_topic"] = stateTopic;
  if (unitOfMeasurement != "") { json["unit_of_measurement"] = unitOfMeasurement; }
  json["value_template"] = valueTemplate;
  if (stateClass != "") { json["state_class"] = stateClass; }
  json["unique_id"] = uniqueID;
  JsonObject device = json["device"].to<JsonObject>();
  device["name"] = deviceName;
  JsonArray identifiers = device["identifiers"].to<JsonArray>();
  identifiers.add(deviceIdentifier);

  JsonObject availability = json["availability"].to<JsonObject>();
  availability["topic"] =mqttAvailability;

  // <discovery_prefix>/<component>/[<node_id>/]<object_id>/config
  String discoveryTopic = "homeassistant/sensor/"+ spaSerialNumber + "/" + uniqueID + "/config";
  String output = "";
  serializeJson(json,output);
  mqttClient.publish(discoveryTopic.c_str(),output.c_str(),true);

}


/// @brief Publish a Binary Sensor via MQTT auto discovery
/// @param name Sensor name
/// @param deviceClass Sensor, etc
/// @param stateTopic Mqtt topic to read state information from.
/// @param valueTemplate HA value template to parse topic payload to derive value
/// @param propertId Unique ID of the property
/// @param deviceName Spa name eg MySpa
/// @param deviceIdentifier Spa serial number eg 123456-789012
void binarySensorADPublish (String name, String deviceClass, String stateTopic, String valueTemplate, String propertyId, String deviceName, String deviceIdentifier) {
/*
{
  "name":null,
  "device_class":"motion",
  "state_topic":"homeassistant/binary_sensor/garden/state",
  "unique_id":"motion01ad",
  "device":{
    "identifiers":[
        "01ad"
    ],
    "name":"Garden"
  }
}*/

  JsonDocument json;
  String uniqueID = spaSerialNumber + "-" + propertyId;

  if (deviceClass != "") { json["device_class"] = deviceClass; }
  json["name"]=name;
  json["state_topic"] = stateTopic;
  json["value_template"] = valueTemplate;
  json["unique_id"] = uniqueID;
  JsonObject device = json["device"].to<JsonObject>();
  device["name"] = deviceName;
  JsonArray identifiers = device["identifiers"].to<JsonArray>();
  identifiers.add(deviceIdentifier);

  JsonObject availability = json["availability"].to<JsonObject>();
  availability["topic"] =mqttAvailability;

  // <discovery_prefix>/<component>/[<node_id>/]<object_id>/config
  String discoveryTopic = "homeassistant/binary_sensor/"+ spaSerialNumber + "/" + uniqueID + "/config";
  String output = "";
  serializeJson(json,output);
  mqttClient.publish(discoveryTopic.c_str(),output.c_str(),true);

}

/// @brief Publish a Climate control via MQTT auto discovery
/// @param name Sensor name
/// @param propertId Unique ID of the property
/// @param deviceName Spa name eg MySpa
/// @param deviceIdentifier Spa serial number eg 123456-789012
void climateADPublish(String name, String propertyId, String deviceName, String deviceIdentifier ) {

/*
{ 
   "device_class":"temperature",
   "state_topic":"homeassistant/sensor/sensorBedroom/state",
   "unit_of_measurement":"°C",
   "value_template":"{{ value_json.temperature}}",
   "unique_id":"temp01ae",
   "device":{
      "identifiers":[
         "bedroom01ae"
      ],
      "name":"Bedroom"
   }
}"
*/

  JsonDocument json;
  String uniqueID = spaSerialNumber + "-" + propertyId;

